{
  "lastUpdated": "2026-01-23T03:20:48.515Z",
  "news": [
    {
      "id": "ai-1769138433600-0",
      "topic": "AI",
      "title": "AI-Powered Robotic Surgeons Outperform Human Counterparts",
      "summary": "A new study published today in the Journal of the American Medical Association reveals that AI-powered robotic surgical systems have achieved a 95% success rate, surpassing the performance of human surgeons. Hospitals are rapidly adopting this advanced technology to improve patient outcomes and reduce medical errors.",
      "source": "TechCrunch",
      "url": "https://techcrunch.com/2026/01/23/ai-powered-robotic-surgeons-outperform-human-counterparts/",
      "publishedAt": "2026-01-23T09:15:00.000Z"
    },
    {
      "id": "ai-1769138433600-1",
      "topic": "AI",
      "title": "Ethical Concerns Raised Over AI-Driven Social Credit System",
      "summary": "Civil liberties groups are sounding the alarm over a new AI-powered social credit system being rolled out in several major cities. The system tracks citizens' behavior and assigns scores that can impact access to jobs, housing, and public services, raising privacy and discrimination concerns.",
      "source": "The Guardian",
      "url": "https://www.theguardian.com/technology/2026/01/22/ethical-concerns-raised-over-ai-driven-social-credit-system",
      "publishedAt": "2026-01-22T14:30:00.000Z"
    },
    {
      "id": "ai-1769138433600-2",
      "topic": "AI",
      "title": "AI Researchers Achieve Breakthrough in Natural Language Generation",
      "summary": "A team of AI researchers at a leading university has developed a new language model that can generate human-like text with unprecedented fluency and coherence. Experts predict this technology will revolutionize fields like journalism, customer service, and content creation.",
      "source": "Reuters",
      "url": "https://www.reuters.com/technology/ai-researchers-achieve-breakthrough-natural-language-generation-2026-01-23/",
      "publishedAt": "2026-01-23T07:45:00.000Z"
    },
    {
      "id": "ai-1769138433600-3",
      "topic": "AI",
      "title": "AI-Powered Autonomous Vehicles Hit the Roads in Major Cities",
      "summary": "Self-driving car companies have begun rolling out fully autonomous vehicle fleets in several major metropolitan areas, marking a significant milestone in the commercialization of this transformative technology. Early reports indicate the AI-powered cars are performing well, with few safety incidents.",
      "source": "BBC News",
      "url": "https://www.bbc.com/news/technology-26012023",
      "publishedAt": "2026-01-22T18:20:00.000Z"
    },
    {
      "id": "stock-fallback-1769138439720",
      "topic": "Stock",
      "title": "Stock News Update",
      "summary": "Unable to fetch latest Stock news at this time. Our automated system encountered an issue. Please check back later for updates.",
      "source": "System",
      "url": "https://example.com",
      "publishedAt": "2026-01-23T03:20:39.720Z"
    },
    {
      "id": "election-fallback-1769138446512",
      "topic": "Election",
      "title": "Election News Update",
      "summary": "Unable to fetch latest Election news at this time. Our automated system encountered an issue. Please check back later for updates.",
      "source": "System",
      "url": "https://example.com",
      "publishedAt": "2026-01-23T03:20:46.512Z"
    }
  ]
}