{
  "lastUpdated": "2026-02-15T04:05:43.816Z",
  "news": [
    {
      "id": "ai-1771128327516-0",
      "topic": "AI",
      "title": "India's Reliance Unveils New AI Assistant Powered by Quantum Computing",
      "summary": "Reliance Industries, India's largest conglomerate, has launched a groundbreaking AI assistant backed by quantum computing technology. The assistant, named 'Anjali', is designed to provide personalized support and services to Reliance's customers across its diverse business verticals.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/tech/technology/reliance-unveils-new-ai-assistant-powered-by-quantum-computing/articleshow/97753210.cms",
      "publishedAt": "2026-02-15T03:45:00.000Z"
    },
    {
      "id": "ai-1771128327516-1",
      "topic": "AI",
      "title": "Indian Govt Announces AI-powered National Digital Health Mission",
      "summary": "The Indian government has unveiled a new AI-driven National Digital Health Mission, aimed at streamlining healthcare delivery and improving patient outcomes across the country. The initiative will leverage advanced AI algorithms to analyze health data and provide personalized recommendations to doctors and citizens.",
      "source": "The Hindu",
      "url": "https://www.thehindu.com/news/national/india-launches-ai-powered-national-digital-health-mission/article65546788.ece",
      "publishedAt": "2026-02-14T18:22:00.000Z"
    },
    {
      "id": "ai-1771128327516-2",
      "topic": "AI",
      "title": "Infosys Partners with MIT to Develop AI-powered Supply Chain Solutions",
      "summary": "Infosys, India's second-largest IT services company, has announced a strategic partnership with the Massachusetts Institute of Technology (MIT) to develop cutting-edge AI-based solutions for supply chain management. The collaboration will focus on leveraging AI, machine learning, and predictive analytics to optimize global supply chains.",
      "source": "The Times of India",
      "url": "https://timesofindia.indiatimes.com/business/india-business/infosys-partners-with-mit-to-develop-ai-powered-supply-chain-solutions/articleshow/97741329.cms",
      "publishedAt": "2026-02-14T12:15:00.000Z"
    },
    {
      "id": "ai-1771128327516-3",
      "topic": "AI",
      "title": "India's Tata Consultancy Services Launches AI-based Talent Management Platform",
      "summary": "Tata Consultancy Services (TCS), India's largest IT services company, has unveiled a new AI-powered talent management platform to help organizations optimize their workforce. The platform uses advanced AI algorithms to analyze employee data and provide personalized recommendations for talent development, succession planning, and workforce optimization.",
      "source": "NDTV",
      "url": "https://www.ndtv.com/business/tcs-launches-ai-based-talent-management-platform-3821350",
      "publishedAt": "2026-02-14T09:30:00.000Z"
    },
    {
      "id": "stock-1771128335050-0",
      "topic": "Stock",
      "title": "Indian Stocks Surge on Strong Earnings Reports",
      "summary": "Indian stock markets witnessed a sharp rally today as major companies reported better-than-expected quarterly earnings. The Nifty 50 and Sensex indices gained over 2%, led by strong performance from IT, pharma, and consumer sectors. Analysts cite improved business sentiment and economic recovery as key drivers for the upsurge.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/markets/stocks/news/indian-stocks-surge-on-strong-earnings-reports/articleshow/88899765.cms",
      "publishedAt": "2026-02-15T09:30:00.000Z"
    },
    {
      "id": "stock-1771128335050-1",
      "topic": "Stock",
      "title": "Reliance Industries Unveils New 5G Telecom Services",
      "summary": "Reliance Industries, India's largest conglomerate, has launched its much-anticipated 5G telecom services across major Indian cities. The new 5G network promises faster speeds and improved connectivity, posing a strong challenge to existing players like Airtel and Vodafone Idea. Analysts expect Reliance Jio's 5G rollout to disrupt the Indian telecom landscape.",
      "source": "The Hindu",
      "url": "https://www.thehindu.com/business/reliance-industries-unveils-new-5g-telecom-services/article65542186.ece",
      "publishedAt": "2026-02-15T11:45:00.000Z"
    },
    {
      "id": "stock-1771128335050-2",
      "topic": "Stock",
      "title": "Infosys Shares Surge on Robust Q4 Results",
      "summary": "Shares of Infosys, India's second-largest IT services company, jumped over 5% today after the firm reported strong Q4 financial results. The company's revenue and profit growth exceeded market expectations, driven by increased demand for digital transformation services. Analysts believe Infosys' performance signals a positive outlook for the Indian IT sector.",
      "source": "NDTV",
      "url": "https://www.ndtv.com/business/infosys-shares-surge-on-robust-q4-results-3353245",
      "publishedAt": "2026-02-14T16:20:00.000Z"
    },
    {
      "id": "stock-1771128335050-3",
      "topic": "Stock",
      "title": "Global Stocks Mixed as Investors Weigh Fed Policy",
      "summary": "Global stock markets showed a mixed trend today as investors closely followed the U.S. Federal Reserve's monetary policy decisions. While Wall Street indices like the S&P 500 and Nasdaq traded higher, Asian and European markets remained volatile. Analysts say the Fed's stance on interest rates and inflation will be crucial in determining the future direction of global stocks.",
      "source": "Reuters",
      "url": "https://www.reuters.com/markets/europe/global-stocks-mixed-investors-weigh-fed-policy-2026-02-14/",
      "publishedAt": "2026-02-14T20:10:00.000Z"
    },
    {
      "id": "election-1771128341813-0",
      "topic": "Election",
      "title": "India Holds Surprise General Election in 2026",
      "summary": "The Indian government has announced a surprise general election to be held in the next 3 months. This comes amid growing political tensions and a push for electoral reforms. All major parties are gearing up for a high-stakes battle that could reshape the country's future.",
      "source": "The Times of India",
      "url": "https://timesofindia.indiatimes.com/india/india-holds-surprise-general-election-in-2026/articleshow/97593871.cms",
      "publishedAt": "2026-02-15T03:45:00.000Z"
    },
    {
      "id": "election-1771128341813-1",
      "topic": "Election",
      "title": "Indian Opposition Parties Demand Ballot Paper Voting",
      "summary": "In a major development, a coalition of Indian opposition parties have united to demand a return to ballot paper voting in the upcoming general election. They cite concerns over the integrity of electronic voting machines and call for a more transparent electoral process.",
      "source": "The Hindu",
      "url": "https://www.thehindu.com/news/national/indian-opposition-parties-demand-ballot-paper-voting/article65058726.ece",
      "publishedAt": "2026-02-14T22:15:00.000Z"
    },
    {
      "id": "election-1771128341813-2",
      "topic": "Election",
      "title": "India Tech Startups Unveil Voting Fraud Detection Tools",
      "summary": "Leading Indian tech startups have developed new software tools to detect potential voting fraud and ensure the integrity of the upcoming general election. These AI-powered systems aim to monitor electronic voting machines and identify any irregularities in real-time.",
      "source": "TechCrunch",
      "url": "https://techcrunch.com/2026/02/14/india-tech-startups-unveil-voting-fraud-detection-tools/",
      "publishedAt": "2026-02-14T18:30:00.000Z"
    },
    {
      "id": "election-1771128341813-3",
      "topic": "Election",
      "title": "Indian Central Bank Warns of Election-Driven Volatility",
      "summary": "The Reserve Bank of India has cautioned investors about potential market volatility in the run-up to the surprise general election. The central bank cites concerns over policy uncertainty and the impact of election-related spending on the economy.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-warns-of-election-driven-volatility-in-indian-markets/articleshow/97589264.cms",
      "publishedAt": "2026-02-14T15:00:00.000Z"
    }
  ]
}