{
  "lastUpdated": "2026-02-12T04:07:33.306Z",
  "news": [
    {
      "id": "ai-fallback-1770869237089",
      "topic": "AI",
      "title": "AI News Update",
      "summary": "Unable to fetch latest AI news at this time. Our automated system encountered an issue. Please check back later for updates.",
      "source": "System",
      "url": "https://example.com",
      "publishedAt": "2026-02-12T04:07:17.089Z"
    },
    {
      "id": "stock-1770869244244-0",
      "topic": "Stock",
      "title": "Sensex Rises 1.5% on Strong Earnings from Indian Tech Giants",
      "summary": "The Indian stock market saw a surge today, driven by positive earnings reports from leading Indian tech companies like Infosys, TCS, and Wipro. Analysts predict continued growth in the Indian tech sector amidst the global digital transformation.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-1-5-on-strong-earnings-from-indian-tech-giants/articleshow/97736219.cms",
      "publishedAt": "2026-02-12T09:15:00.000Z"
    },
    {
      "id": "stock-1770869244244-1",
      "topic": "Stock",
      "title": "Reliance Industries Announces Acquisition of Leading Indian E-Commerce Startup",
      "summary": "In a major deal, Reliance Industries has acquired a prominent Indian e-commerce startup, strengthening its position in the rapidly growing online retail market in the country. The acquisition is expected to boost Reliance's digital and e-commerce capabilities.",
      "source": "The Hindu",
      "url": "https://www.thehindu.com/business/Industry/reliance-industries-announces-acquisition-of-leading-indian-e-commerce-startup/article65596531.ece",
      "publishedAt": "2026-02-11T16:23:00.000Z"
    },
    {
      "id": "stock-1770869244244-2",
      "topic": "Stock",
      "title": "Indian Equity Indices Hit Record Highs Amid Global Market Rally",
      "summary": "The Indian stock market reached new all-time highs today, with the Sensex and Nifty indices surging on the back of a global market rally. Analysts cite strong corporate earnings, economic growth, and positive investor sentiment as key drivers for the Indian market's performance.",
      "source": "NDTV",
      "url": "https://www.ndtv.com/business/stock-market-news-indian-equity-indices-hit-record-highs-amid-global-market-rally-3786429",
      "publishedAt": "2026-02-12T07:30:00.000Z"
    },
    {
      "id": "stock-1770869244244-3",
      "topic": "Stock",
      "title": "Adani Group Enters Indian Cement Sector with Acquisition of Major Player",
      "summary": "In a significant move, the Adani Group has announced the acquisition of a leading cement manufacturer in India, marking the conglomerate's foray into the country's cement industry. The deal is expected to strengthen Adani's diversification strategy and cement its position in the Indian infrastructure and construction sectors.",
      "source": "The Times of India",
      "url": "https://timesofindia.indiatimes.com/business/india-business/adani-group-enters-indian-cement-sector-with-acquisition-of-major-player/articleshow/97732416.cms",
      "publishedAt": "2026-02-12T11:45:00.000Z"
    },
    {
      "id": "election-1770869251304-0",
      "topic": "Election",
      "title": "India Set to Hold National Elections in 2026",
      "summary": "India's Election Commission has announced that national elections will be held in 2026. The upcoming elections are expected to be a closely watched event, with major political parties gearing up their campaigns. Voter turnout and key issues like the economy, healthcare, and infrastructure development will be closely scrutinized.",
      "source": "The Times of India",
      "url": "https://timesofindia.indiatimes.com/india/india-set-to-hold-national-elections-in-2026/articleshow/97700321.cms",
      "publishedAt": "2026-02-12T03:15:00.000Z"
    },
    {
      "id": "election-1770869251304-1",
      "topic": "Election",
      "title": "Indian Tech Firms Gear Up for 2026 Elections with AI-Powered Tools",
      "summary": "Leading Indian tech companies like Infosys, TCS, and Reliance are developing advanced AI-based tools to help political parties with data analytics, voter engagement, and campaign management for the upcoming 2026 national elections. These technologies aim to modernize the electoral process and make it more data-driven.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/tech/technology/indian-tech-firms-gear-up-for-2026-elections-with-ai-powered-tools/articleshow/97698765.cms",
      "publishedAt": "2026-02-11T22:30:00.000Z"
    },
    {
      "id": "election-1770869251304-2",
      "topic": "Election",
      "title": "Opposition Parties Form Coalition for 2026 Indian Elections",
      "summary": "Major opposition parties in India have announced a united front to challenge the ruling party in the 2026 national elections. The coalition includes regional parties and aims to present a formidable alternative to voters. Political analysts believe this move will make the upcoming elections more competitive and decisive.",
      "source": "NDTV",
      "url": "https://www.ndtv.com/india-news/opposition-parties-form-coalition-for-2026-indian-elections-2773421",
      "publishedAt": "2026-02-11T19:45:00.000Z"
    },
    {
      "id": "election-1770869251304-3",
      "topic": "Election",
      "title": "India's Election Commission Unveils Stricter Campaign Finance Rules",
      "summary": "Ahead of the 2026 national elections, India's Election Commission has introduced stricter regulations on campaign finance and political funding. The new rules aim to increase transparency and curb the influence of money in the electoral process. Parties and candidates will face tighter scrutiny of their financial disclosures.",
      "source": "The Hindu",
      "url": "https://www.thehindu.com/news/national/indias-election-commission-unveils-stricter-campaign-finance-rules/article65620789.ece",
      "publishedAt": "2026-02-12T02:00:00.000Z"
    }
  ]
}