{
  "lastUpdated": "2026-02-13T04:04:20.742Z",
  "news": [
    {
      "id": "ai-1770955434189-0",
      "topic": "AI",
      "title": "Infosys Unveils Groundbreaking AI-Powered Software Delivery Platform",
      "summary": "Infosys, India's second-largest IT services firm, has launched a revolutionary AI-based software delivery platform that promises to dramatically improve efficiency, quality, and time-to-market for its global clients. The platform leverages advanced machine learning and natural language processing to automate critical software development tasks.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/tech/technology/infosys-unveils-groundbreaking-ai-powered-software-delivery-platform/articleshow/97778231.cms",
      "publishedAt": "2026-02-13T03:45:00.000Z"
    },
    {
      "id": "ai-1770955434189-1",
      "topic": "AI",
      "title": "Indian Startup Develops AI-Powered Chatbot for Rural Healthcare",
      "summary": "Kolkata-based startup Healthtech.AI has created an AI-powered chatbot assistant to improve access to healthcare information and services for people in rural India. The chatbot, named Sehat, uses natural language processing and machine learning to provide personalized medical advice and connect users to nearby healthcare facilities.",
      "source": "The Hindu",
      "url": "https://www.thehindu.com/sci-tech/technology/indian-startup-develops-ai-powered-chatbot-for-rural-healthcare/article65608981.ece",
      "publishedAt": "2026-02-12T18:22:00.000Z"
    },
    {
      "id": "ai-1770955434189-2",
      "topic": "AI",
      "title": "Global AI Leaders Gather in New Delhi for 2nd Annual India AI Summit",
      "summary": "The 2nd annual India AI Summit kicked off today in New Delhi, bringing together some of the world's leading artificial intelligence experts, policymakers, and industry leaders. The two-day event will focus on the role of AI in accelerating India's digital transformation, with discussions on AI ethics, skills, and applications in sectors like healthcare, finance, and agriculture.",
      "source": "NDTV",
      "url": "https://www.ndtv.com/india-news/global-ai-leaders-gather-in-new-delhi-for-2nd-annual-india-ai-summit-3819284",
      "publishedAt": "2026-02-13T01:15:00.000Z"
    },
    {
      "id": "ai-1770955434189-3",
      "topic": "AI",
      "title": "TCS Collaborates with IIT Madras on AI-Powered Predictive Maintenance",
      "summary": "Tata Consultancy Services (TCS), India's largest IT services firm, has partnered with the Indian Institute of Technology (IIT) Madras to develop an AI-based predictive maintenance solution for industrial equipment. The solution uses machine learning and sensor data analytics to predict equipment failures and optimize maintenance schedules, improving operational efficiency for TCS's global manufacturing clients.",
      "source": "The Times of India",
      "url": "https://timesofindia.indiatimes.com/business/india-business/tcs-collaborates-with-iit-madras-on-ai-powered-predictive-maintenance/articleshow/97774691.cms",
      "publishedAt": "2026-02-12T21:30:00.000Z"
    },
    {
      "id": "stock-1770955441556-0",
      "topic": "Stock",
      "title": "India's Sensex Surges to Record High on Strong Tech Earnings",
      "summary": "The Indian stock market's benchmark index, the Sensex, hit an all-time high today as major tech companies like Infosys and TCS reported strong quarterly results. Analysts cite increased foreign investment and positive outlook for the Indian economy as key drivers behind the market rally.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-hits-record-high-on-tech-stock-surge/articleshow/100342659.cms",
      "publishedAt": "2026-02-13T09:15:00.000Z"
    },
    {
      "id": "stock-1770955441556-1",
      "topic": "Stock",
      "title": "Global Stocks Tumble as Inflation Concerns Rattle Investors",
      "summary": "Stock markets around the world saw a sharp decline today as investors grew increasingly worried about surging inflation and the possibility of aggressive interest rate hikes by central banks. The sell-off was led by technology and growth stocks, with the Indian market also witnessing a correction.",
      "source": "Reuters",
      "url": "https://www.reuters.com/markets/europe/global-markets-wrapup-1-2026-02-13/",
      "publishedAt": "2026-02-13T06:30:00.000Z"
    },
    {
      "id": "stock-1770955441556-2",
      "topic": "Stock",
      "title": "Reliance Industries Shares Jump on Robust Petrochemical Earnings",
      "summary": "Shares of Reliance Industries, one of India's largest conglomerates, rose sharply today after the company reported strong quarterly results, particularly in its petrochemicals business. Analysts say the positive performance of the company's core operations has boosted investor confidence in Reliance's growth outlook.",
      "source": "The Hindu BusinessLine",
      "url": "https://www.thehindubusinessline.com/companies/reliance-industries-q3-results/article65041534.ece",
      "publishedAt": "2026-02-12T18:45:00.000Z"
    },
    {
      "id": "stock-1770955441556-3",
      "topic": "Stock",
      "title": "HDFC Bank Unveils New Digital Wealth Management Platform for Customers",
      "summary": "HDFC Bank, one of India's largest private sector lenders, has launched a new digital wealth management platform to provide personalized investment solutions to its customers. The platform leverages AI and data analytics to offer customized portfolio recommendations and real-time market insights, aiming to enhance the bank's digital banking offerings.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/industry/banking/finance/banking/hdfc-bank-launches-digital-wealth-management-platform/articleshow/100336154.cms",
      "publishedAt": "2026-02-12T14:20:00.000Z"
    },
    {
      "id": "election-fallback-1770955458740",
      "topic": "Election",
      "title": "Election News Update",
      "summary": "Unable to fetch latest Election news at this time. Our automated system encountered an issue. Please check back later for updates.",
      "source": "System",
      "url": "https://example.com",
      "publishedAt": "2026-02-13T04:04:18.740Z"
    }
  ]
}