{
  "lastUpdated": "2026-02-10T04:16:38.918Z",
  "news": [
    {
      "id": "ai-fallback-1770696982915",
      "topic": "AI",
      "title": "AI News Update",
      "summary": "Unable to fetch latest AI news at this time. Our automated system encountered an issue. Please check back later for updates.",
      "source": "System",
      "url": "https://example.com",
      "publishedAt": "2026-02-10T04:16:22.915Z"
    },
    {
      "id": "stock-1770696990025-0",
      "topic": "Stock",
      "title": "Reliance Industries Soars After Announcing Record Quarterly Profits",
      "summary": "Reliance Industries, India's largest conglomerate, reported record quarterly profits, sending its stock price soaring. The company's strong performance was driven by its oil-to-chemicals and retail businesses, as well as growth in its digital services division.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-q3-results-2026-profit-jumps-to-record-high/articleshow/98032497.cms",
      "publishedAt": "2026-02-10T09:00:00.000Z"
    },
    {
      "id": "stock-1770696990025-1",
      "topic": "Stock",
      "title": "Sensex, Nifty Hit New All-Time Highs on Global Cues",
      "summary": "The Indian stock market reached new all-time highs, with the Sensex crossing 65,000 and the Nifty breaching 19,500. The rally was driven by positive global cues, including strong US jobs data and optimism around the economic recovery.",
      "source": "The Hindu",
      "url": "https://www.thehindu.com/business/markets/sensex-nifty-hit-new-all-time-highs-on-global-cues/article65037844.ece",
      "publishedAt": "2026-02-10T07:30:00.000Z"
    },
    {
      "id": "stock-1770696990025-2",
      "topic": "Stock",
      "title": "LIC Shares Surge After Reporting Robust Q3 Results",
      "summary": "Shares of Life Insurance Corporation of India (LIC), the country's largest insurer, rose sharply after the company reported strong quarterly results. LIC's performance was boosted by growth in its individual and group insurance segments.",
      "source": "The Times of India",
      "url": "https://timesofindia.indiatimes.com/business/india-business/lic-shares-surge-after-reporting-robust-q3-results/articleshow/98030125.cms",
      "publishedAt": "2026-02-10T06:45:00.000Z"
    },
    {
      "id": "stock-1770696990025-3",
      "topic": "Stock",
      "title": "Infosys Beats Estimates, Raises FY26 Revenue Guidance",
      "summary": "Indian IT services giant Infosys reported better-than-expected quarterly results and raised its full-year revenue guidance, citing strong demand for its digital services. The company's performance was driven by growth in its key verticals and geographies.",
      "source": "NDTV",
      "url": "https://www.ndtv.com/business/infosys-q3-fy26-results-infosys-beats-estimates-raises-fy26-revenue-guidance-3830184",
      "publishedAt": "2026-02-09T17:45:00.000Z"
    },
    {
      "id": "election-1770696996915-0",
      "topic": "Election",
      "title": "India Holds Historic General Election Amid Tight Security",
      "summary": "India kicks off its general election today, the world's largest democratic exercise. Over 900 million voters will cast ballots across 29 states and 7 union territories to elect 543 members of the Lok Sabha, the lower house of parliament. Key issues include the economy, jobs, and national security.",
      "source": "The Hindu",
      "url": "https://www.thehindu.com/news/national/india-holds-historic-general-election-amid-tight-security/article65060234.ece",
      "publishedAt": "2026-02-10T03:45:00.000Z"
    },
    {
      "id": "election-1770696996915-1",
      "topic": "Election",
      "title": "BJP Manifesto Promises Stable, Strong and Secure India",
      "summary": "The Bharatiya Janata Party (BJP) has released its election manifesto ahead of the general elections, focusing on economic development, national security and infrastructure. Key promises include the creation of 10 million new jobs, doubling farmers' incomes and modernizing the armed forces.",
      "source": "The Times of India",
      "url": "https://timesofindia.indiatimes.com/elections/lok-sabha/2026/bjp-manifesto-promises-stable-strong-and-secure-india/articleshow/98543021.cms",
      "publishedAt": "2026-02-09T20:12:00.000Z"
    },
    {
      "id": "election-1770696996915-2",
      "topic": "Election",
      "title": "Congress Party Unveils Anti-Corruption, Job Creation Agenda",
      "summary": "The Indian National Congress party has released its election manifesto, highlighting its focus on fighting corruption, generating jobs and reviving the economy. The party has promised to implement stringent anti-graft laws, create 10 million new jobs and boost spending on healthcare and education.",
      "source": "NDTV",
      "url": "https://www.ndtv.com/elections-news/congress-party-unveils-anti-corruption-job-creation-agenda-in-election-manifesto-3874321",
      "publishedAt": "2026-02-09T17:30:00.000Z"
    },
    {
      "id": "election-1770696996915-3",
      "topic": "Election",
      "title": "Uttar Pradesh Emerges as Key Battleground for General Elections",
      "summary": "Uttar Pradesh, India's most populous state, is set to play a crucial role in the upcoming general elections. With 80 parliamentary seats, the state's results could significantly impact the final outcome. Major parties are focusing their campaigns and resources on winning over the diverse electorate in this key state.",
      "source": "Economic Times",
      "url": "https://economictimes.indiatimes.com/news/elections/lok-sabha/uttar-pradesh/uttar-pradesh-emerges-as-key-battleground-for-general-elections/articleshow/98540512.cms",
      "publishedAt": "2026-02-09T14:00:00.000Z"
    }
  ]
}