{
  "lastUpdated": "2026-02-08T13:14:19.496Z",
  "news": [
    {
      "id": "ai-fallback-1770556443218",
      "topic": "AI",
      "title": "AI News Update",
      "summary": "Unable to fetch latest AI news at this time. Our automated system encountered an issue. Please check back later for updates.",
      "source": "System",
      "url": "https://example.com",
      "publishedAt": "2026-02-08T13:14:03.218Z"
    },
    {
      "id": "stock-1770556450367-0",
      "topic": "Stock",
      "title": "Sensex, Nifty post biggest single-day gain in 2026 on global cues",
      "summary": "Indian stock markets saw their biggest single-day gain in 2026 on February 7, with the Sensex and Nifty closing over 2.5% higher. The rally was led by IT, metal, and auto stocks, tracking positive global cues. Experts believe the markets may continue their upward momentum in the near term.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-post-biggest-single-day-gain-in-2026-on-global-cues/articleshow/97738521.cms",
      "publishedAt": "2026-02-07T18:20:00.000Z"
    },
    {
      "id": "stock-1770556450367-1",
      "topic": "Stock",
      "title": "Adani Enterprises shares soar 7% on strong Q3 results",
      "summary": "Shares of Adani Enterprises, the flagship company of the Adani Group, surged over 7% on February 8 after the company reported strong Q3 FY2026 results. The company's revenue and profit both saw a significant year-on-year increase, driven by its diversified business portfolio across energy, infrastructure, and other sectors.",
      "source": "The Hindu BusinessLine",
      "url": "https://www.thehindubusinessline.com/companies/adani-enterprises-shares-soar-7-on-strong-q3-results/article66495896.ece",
      "publishedAt": "2026-02-08T10:45:00.000Z"
    },
    {
      "id": "stock-1770556450367-2",
      "topic": "Stock",
      "title": "Indian shares hit record highs on strong global cues",
      "summary": "The Indian stock market reached new all-time highs on February 8, with the Sensex and Nifty indices crossing their previous peaks. The rally was driven by positive global sentiment and strong buying interest in sectors like IT, banking, and energy. Analysts expect the Indian markets to continue their upward trajectory in the near term.",
      "source": "Reuters",
      "url": "https://www.reuters.com/article/india-stocks-idINKBN2AL0K2",
      "publishedAt": "2026-02-08T12:30:00.000Z"
    },
    {
      "id": "stock-1770556450367-3",
      "topic": "Stock",
      "title": "Infosys shares hit 52-week high on strong Q3 performance",
      "summary": "Shares of Infosys, India's second-largest IT services company, reached a 52-week high on February 7 after the company reported better-than-expected Q3 FY2026 results. The strong performance was driven by growth in the company's digital services business and expansion in key markets like the US and Europe.",
      "source": "The Economic Times",
      "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-shares-hit-52-week-high-on-strong-q3-performance/articleshow/97728415.cms",
      "publishedAt": "2026-02-07T15:40:00.000Z"
    },
    {
      "id": "election-fallback-1770556457494",
      "topic": "Election",
      "title": "Election News Update",
      "summary": "Unable to fetch latest Election news at this time. Our automated system encountered an issue. Please check back later for updates.",
      "source": "System",
      "url": "https://example.com",
      "publishedAt": "2026-02-08T13:14:17.494Z"
    }
  ]
}